Tekla Open API Reference for Tekla Structures 2025
Contour Methods
The Contour type exposes the following members.
Methods
Name | Description
AddContourPoint
 Adds a new contour point to the contour. Do not add the same contour point twice.
CalculatePolygon
 Calculate a polygon approximating the contour with chamfers evaluated.
GetPolycurve
 Gets the contour geometry as Polycurve
Top
See Also
Reference
Contour Class
Tekla.Structures.Model Namespace